[Survived] StringLiteral
src/components/AppBar.tsx:19:19
 
     const appbaritems = [
         {
-            name: "activity",
+            name: "",
             icon: Tab,
             path: "/",

[Survived] StringLiteral
src/components/AppBar.tsx:24:19
             path: "/",
         },
         {
-            name: "chat",
+            name: "",
             icon: Tab1,
             path: "/",

[Survived] ObjectLiteral
src/components/AppBar.tsx:27:12
             name: "chat",
             icon: Tab1,
             path: "/",
-        }, {
-            name: "teams",
-            icon: Tab2,
-            path: "/",
-        }
+        }, {}
         , {
             name: "calender",

[Survived] StringLiteral
src/components/AppBar.tsx:30:19
         }, {
             name: "teams",
             icon: Tab2,
-            path: "/",
+            path: "",
         }
         , {

[Survived] ObjectLiteral
src/components/AppBar.tsx:36:12
             name: "calender",
             icon: Tab3,
             path: "/",
-        }, {
-            name: "calls",
-            icon: Tab4,
-            path: "/",
-        }, {
+        }, {}, {
             name: "files",
             icon: Tab5,

[Survived] StringLiteral
src/components/AppBar.tsx:39:19
         }, {
             name: "calls",
             icon: Tab4,
-            path: "/",
+            path: "",
         }, {
             name: "files",

[Survived] StringLiteral
src/components/AppBar.tsx:45:19
             icon: Tab5,
             path: "/",
         }, {
-            name: "contos",
+            name: "",
             icon: Tab6,
             path: "/",

[Survived] ObjectLiteral
src/components/AppBar.tsx:53:11
             icon: Tab7,
             path: "/",
         }
-        , {
-            name: "addApps",
-            icon: Tab8,
-            path: "/",
-        }
+        , {}
     ]
 

[Survived] StringLiteral
src/components/AppBar.tsx:56:19
         , {
             name: "addApps",
             icon: Tab8,
-            path: "/",
+            path: "",
         }
     ]

[Survived] BlockStatement
src/components/AppBar.tsx:62:71
 
     const [currentTab, setCurrentTab] = useState(appbaritems[0].name);
 
-    const handleSwitchTabs = (e : React.MouseEvent<HTMLLIElement>) => {
-        setCurrentTab(e.currentTarget.id)
-    }
+    const handleSwitchTabs = (e : React.MouseEvent<HTMLLIElement>) => {}
 
 

[Survived] StringLiteral
src/components/AppBar.tsx:68:71
 
 
     return (
-        <ul className='' style={{ backgroundColor: "#E6ECF3", height: "100dvh" }}>
+        <ul className='' style={{ backgroundColor: "#E6ECF3", height: "" }}>
 
             {

[Survived] StringLiteral
src/components/AppBar.tsx:68:52
 
 
     return (
-        <ul className='' style={{ backgroundColor: "#E6ECF3", height: "100dvh" }}>
+        <ul className='' style={{ backgroundColor: "", height: "100dvh" }}>
 
             {

[Survived] BlockStatement
src/components/AppBar.tsx:71:50
         <ul className='' style={{ backgroundColor: "#E6ECF3", height: "100dvh" }}>
 
             {
-                appbaritems.map((item, index) => {
-                    return (
-                        <li  id={item.name+index} className="appbar-item"  onClick={handleSwitchTabs}><Link to={`/${item.name}`} className=' d-flex align-items-center justify-content-between'>
-                            {
-                                item.name === currentTab &&
-                                <img src={SelectedBar} alt="" className='' />
-
-                            }            <img src={item.icon} alt="" className=' mx-auto d-block' />
-                        </Link></li>
-                    )
-                })
+                appbaritems.map((item, index) => {})
             }
 

[Survived] ArithmeticOperator
src/components/AppBar.tsx:73:34
             {
                 appbaritems.map((item, index) => {
                     return (
-                        <li  id={item.name+index} className="appbar-item"  onClick={handleSwitchTabs}><Link to={`/${item.name}`} className=' d-flex align-items-center justify-content-between'>
+                        <li  id={item.name - index} className="appbar-item"  onClick={handleSwitchTabs}><Link to={`/${item.name}`} className=' d-flex align-items-center justify-content-between'>
                             {
                                 item.name === currentTab &&

[Survived] StringLiteral
src/components/AppBar.tsx:73:113
             {
                 appbaritems.map((item, index) => {
                     return (
-                        <li  id={item.name+index} className="appbar-item"  onClick={handleSwitchTabs}><Link to={`/${item.name}`} className=' d-flex align-items-center justify-content-between'>
+                        <li  id={item.name+index} className="appbar-item"  onClick={handleSwitchTabs}><Link to={``} className=' d-flex align-items-center justify-content-between'>
                             {
                                 item.name === currentTab &&

[Survived] LogicalOperator
src/components/AppBar.tsx:75:33
                     return (
                         <li  id={item.name+index} className="appbar-item"  onClick={handleSwitchTabs}><Link to={`/${item.name}`} className=' d-flex align-items-center justify-content-between'>
                             {
-                                item.name === currentTab &&
-                                <img src={SelectedBar} alt="" className='' />
+                                item.name === currentTab || <img src={SelectedBar} alt="" className='' />
 
                             }            <img src={item.icon} alt="" className=' mx-auto d-block' />

[Survived] EqualityOperator
src/components/AppBar.tsx:75:33
                     return (
                         <li  id={item.name+index} className="appbar-item"  onClick={handleSwitchTabs}><Link to={`/${item.name}`} className=' d-flex align-items-center justify-content-between'>
                             {
-                                item.name === currentTab &&
+                                item.name !== currentTab &&
                                 <img src={SelectedBar} alt="" className='' />
 
